Repository: fatyga/eco_ideas
Catalog: lib/l10n/arb/app_*.arb
Languages: pl

# greetingText
source: Welcome in
pl: Witaj w

# emailTextFieldLabelText
source: Email
pl: Adres e-mail

# passwordTextFieldLabelText
source: Password
pl: Hasło

# usernameTextFieldLabelText
source: Username
pl: Nazwa użytkownika

# passwordRetypeFieldLabelText
source: Retype password
pl: Powtórz hasło

# registerTextButtonLabelText
source: Don't have an account?
pl: Nie masz konta?

# registerTextButtonActionText
source: Register!
pl: Utwórz je!

# forgotPasswordButtonLabelText
source: Forget password?
pl: Zapomniałeś hasła?

# forgotPasswordButtonActionText
source: Change it!
pl: Zmień je!

# aboutMeTextFieldLabelText
source: About me
pl: O mnie

# googleAuthButtonLabelText
source: Continue with Google
pl: Kontynuuj z Google

# signInButtonText
source: Sign In
pl: Zaloguj się

# signInLabeledDividerText
source: OR
pl: LUB

# passwordResetFirstStepAppBarTitleText
source: Reset your password
pl: Zresetuj swoje hasło

# passwordResetSecondStepAppBarTitleText
source: Provide new password
pl: Podaj nowe hasło

# passwordResetFirstStepDescription
source: Please enter an email address with which your account was created.
pl: Podaj adres e-mail, za pomocą którego utworzono konto.

# passwordResetSecondStepDescription
source: In order to finish password reset procedure, please provide new password
pl: Aby ukończyć procedurę zmiany hasła, wprowadź nowe hasło.

# passwordResetLinkSentTitle
source: Link was sent!
pl: Link został wysłany

# passwordResetLinkSentDescription
source: We've sent a link to given email address. Please open it to finish the proccess of resetting password.
pl: Wysłaliśmy ci link na podany przez ciebie adres email. Proszę otwórz go, aby dokończyć proces resetowania hasła

# passwordResetConfirmButtonText
source: Confirm
pl: Zatwierdź

# passwordResetExitDialogTitleText
source: Are you want to cancel?
pl: Czy chcesz przerwać?

# passwordResetExitDescriptionText
source: Password reset procedure will fail.
pl: Procedura zmiany hasła zakończy się niepowodzeniem.

# passwordInputEmptyErrorText
source: Password can't be empty
pl: To pole nie może być puste

# passwordInputTooShortErrorText
source: Password is too short(at least 6 characters)
pl: Hasło jest za krótkie(co najmniej 6 znaków)

# emailInputEmptyErrorText
source: Email can't be empty
pl: To pole nie może być puste

# emailInputInvalidErrorText
source: Email is invalid
pl: Adres e-mail jest nieprawidłowy.

# signUpScreenAppBarTitle
source: Create an account
pl: Utwórz konto

# signUpButtonText
source: Register
pl: Zarejestruj się

# signUpPasswordRetypeInputMismatchErrorText
source: Passwords are mismatched
pl: Hasła są niezgodne

# signUpPasswordretypeInputemptyErrorText
source: This field can't be empty
pl: To pole nie może być puste

# signUpUsernameInputErrorEmptyText
source: Username can't be empty
pl: To pole nie może być puste

# signUpUsernameInputErrorTooShortText
source: Username is too short(at least 6 characters)
pl: Nazwa użytkownika jest za krótka(co najmniej 6 znaków

# signUpConfirmEmailAppBarTitleText
source: Confirm your email
pl: Potwierdź swój email

# signUpConfirmEmailTitle
source: Activation link was sent
pl: Link aktywacjny został wysłany

# signUpConfirmEmailDescription
source: We've sent you an activation link to your mailbox. Please open it to finish the process of signing up
pl: Wysłaliśmy maila z linkiem aktywacyjnym na twoją skrzynkę pocztową. Otwórz go, aby aktywować konto, i ukończyć zakładanie konta.

# signUpCompletionFormTitle
source: Express yourself!
pl: Wyraź siebie!

# signUpCompletionFormDescription
source: Before you start using EcoIdeas, you can let other users get to know you better!
pl: Zanim zaczniesz korzystać z aplikacji, możesz dać się lepiej poznać innym użytkownikom!

# signUpCompletionFormSubmitButton
source: Done!
pl: Gotowe!

# counterAppBarTitle
source: Counter
pl: Licznik

# avatarDialogSaveButtonText
source: Confirm
pl: Zatwierdź

# avatarDialogChangeAvatarButtonLabelText
source: Change avatar
pl: Zmień avatar

# avatarDialogAddAvatarButtonLabelText
source: Add avatar
pl: Dodaj avatar

# avatarDialogDeleteAvatarButtonLabelText
source: Delete avatar
pl: Usuń avatar

# avatarDialogCloseButtonTooltipText
source: Close dialog
pl: Zamknij okno

# avatarDialogPickGalleryOptionLabelText
source: gallery
pl: galeria

# avatarDialogCameraOptionLabelText
source: camera
pl: aparat

# signUpFailSnackBarText
source: Account could not be created.
pl: Nie udało się utworzyć konta.

# updateUserFail
source: Unsuccessful attempt to update user account.
pl: Nie udało się zaktualizować informacji o koncie

# setNewPasswordFail
source: Unsuccessful attempt to set new password
pl: Nie udało się zmienić hasła

# invalidDeepLinkSnackBarText
source: Link has expired or is invalid.
pl: Link wygasł lub jest nieprawidłowy.

# signInFailSnackBarText
source: Unsuccessful sign-in attempt.
pl: Nieudana próba logowania.

# passwordResetLinkSentFailSnackBarText
source: Unsuccessful attempt to send a link.
pl: Nieudana próba wysłania linka.

# setUpNewPasswordFailSnackBarText
source: Unsuccessful attempt to set up new password.
pl: Nieudana próba zmiany hasła.

# signOutFailSnackBarText
source: Unsuccessful attempt to sign out.
pl: Nieudana próba wylogowania.

# getUserProfileFailSnackBarText
source: Unsuccessful attempt to get user profile
pl: Nieudana próba wczytania profilu użytkownika.

# uploadAvatarFailSnackBarText
source: Unsuccessful attempt to upload avatar
pl: Nieudana próba zapisania avataru.

# updateUserProfileFailSnackBarText
source: Unsuccessful attempt to update profile
pl: Nieudana próba zaktualizowania profilu użytkownika.

# homeExploreLabel
source: Explore
pl: Odkrywaj

# homeMyIdeasLabel
source: My ideas
pl: Moje pomysły

# modifyMyProfileAppBarTitle
source: Edit your profile
pl: Edytuj swój profil
